Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/pwm_reg.h
#define PWM_REG43_DF_TIM3_POS (28)
#define PWM_REG43_DF_TIM3_MASK (0xf)

#define PWM_REG44_ADDR (SOC_PWM_REG_BASE + (0x44 << 2))

#define PWM_REG44_CC1IF_POS (0)
#define PWM_REG44_CC1IF_MASK (0x1)

#define PWM_REG44_CC2IF_POS (1)
#define PWM_REG44_CC2IF_MASK (0x1)

#define PWM_REG44_CC3IF_POS (2)
#define PWM_REG44_CC3IF_MASK (0x1)

#define PWM_REG44_CC4IF_POS (3)
#define PWM_REG44_CC4IF_MASK (0x1)

#define PWM_REG44_CC5IF_POS (4)
#define PWM_REG44_CC5IF_MASK (0x1)

#define PWM_REG44_CC6IF_POS (5)
#define PWM_REG44_CC6IF_MASK (0x1)

#define PWM_REG44_CC7IF_POS (6)
#define PWM_REG44_CC7IF_MASK (0x1)

#define PWM_REG44_CC8IF_POS (7)
#define PWM_REG44_CC8IF_MASK (0x1)

#define PWM_REG44_CC9IF_POS (8)
#define PWM_REG44_CC9IF_MASK (0x1)

#define PWM_REG44_UIF1_POS (9)
#define PWM_REG44_UIF1_MASK (0x1)

#define PWM_REG44_UIF2_POS (10)
#define PWM_REG44_UIF2_MASK (0x1)

#define PWM_REG44_UIF3_POS (11)
#define PWM_REG44_UIF3_MASK (0x1)

#define PWM_REG44_TIF1_POS (12)
#define PWM_REG44_TIF1_MASK (0x1)

#define PWM_REG44_TIF2_POS (13)
#define PWM_REG44_TIF2_MASK (0x1)

#define PWM_REG44_TIF3_POS (14)
#define PWM_REG44_TIF3_MASK (0x1)

#define PWM_REG44_COMIF_POS (15)
#define PWM_REG44_COMIF_MASK (0x1)

#define PWM_REG44_RESERVED_16_31_POS (16)
#define PWM_REG44_RESERVED_16_31_MASK (0xffff)

#define PWM_REG45_ADDR (SOC_PWM_REG_BASE + (0x45 << 2))

#define PWM_REG45_RESERVED_0_8_POS (0)
#define PWM_REG45_RESERVED_0_8_MASK (0x1ff)

#define PWM_REG45_UG1_POS (9)
#define PWM_REG45_UG1_MASK (0x1)

#define PWM_REG45_UG2_POS (10)
#define PWM_REG45_UG2_MASK (0x1)

#define PWM_REG45_UG3_POS (11)
#define PWM_REG45_UG3_MASK (0x1)

#define PWM_REG45_TG1_POS (12)
#define PWM_REG45_TG1_MASK (0x1)

#define PWM_REG45_TG2_POS (13)
#define PWM_REG45_TG2_MASK (0x1)

#define PWM_REG45_TG3_POS (14)
#define PWM_REG45_TG3_MASK (0x1)

#define PWM_REG45_COMG_POS (15)
#define PWM_REG45_COMG_MASK (0x1)

#define PWM_REG45_DTM1_POS (16)
#define PWM_REG45_DTM1_MASK (0x3)

#define PWM_REG45_DTM2_POS (18)
#define PWM_REG45_DTM2_MASK (0x3)

#define PWM_REG45_DTM3_POS (20)
#define PWM_REG45_DTM3_MASK (0x3)

#define PWM_REG45_INIT_LEVEL1_POS (22)
#define PWM_REG45_INIT_LEVEL1_MASK (0x1)

#define PWM_REG45_INIT_LEVEL2_POS (23)
#define PWM_REG45_INIT_LEVEL2_MASK (0x1)

#define PWM_REG45_INIT_LEVEL3_POS (24)
#define PWM_REG45_INIT_LEVEL3_MASK (0x1)

#define PWM_REG45_RESERVED_25_31_POS (25)
#define PWM_REG45_RESERVED_25_31_MASK (0x7f)

#define PWM_REG46_ADDR (SOC_PWM_REG_BASE + (0x46 << 2))

#define PWM_REG46_CH1P_POS (0)
#define PWM_REG46_CH1P_MASK (0x3)

#define PWM_REG46_CH2P_POS (2)
#define PWM_REG46_CH2P_MASK (0x3)

#define PWM_REG46_CH3P_POS (4)
#define PWM_REG46_CH3P_MASK (0x3)

#define PWM_REG46_CH4P_POS (6)
#define PWM_REG46_CH4P_MASK (0x3)

#define PWM_REG46_CH5P_POS (8)
#define PWM_REG46_CH5P_MASK (0x3)

#define PWM_REG46_CH6P_POS (10)
#define PWM_REG46_CH6P_MASK (0x3)

#define PWM_REG46_CH1E_POS (12)
#define PWM_REG46_CH1E_MASK (0x1)

#define PWM_REG46_CH2E_POS (13)
#define PWM_REG46_CH2E_MASK (0x1)

#define PWM_REG46_CH3E_POS (14)
#define PWM_REG46_CH3E_MASK (0x1)

#define PWM_REG46_CH4E_POS (15)
#define PWM_REG46_CH4E_MASK (0x1)

#define PWM_REG46_CH5E_POS (16)
#define PWM_REG46_CH5E_MASK (0x1)

#define PWM_REG46_CH6E_POS (17)
#define PWM_REG46_CH6E_MASK (0x1)

#define PWM_REG46_TIM1CCM_POS (18)
#define PWM_REG46_TIM1CCM_MASK (0x1)

#define PWM_REG46_TIM2CCM_POS (19)
#define PWM_REG46_TIM2CCM_MASK (0x1)

#define PWM_REG46_TIM3CCM_POS (20)
#define PWM_REG46_TIM3CCM_MASK (0x1)

#define PWM_REG46_OC1M_POS (21)
#define PWM_REG46_OC1M_MASK (0x7)

#define PWM_REG46_OC2M_POS (24)
#define PWM_REG46_OC2M_MASK (0x7)

#define PWM_REG46_OC3M_POS (27)
#define PWM_REG46_OC3M_MASK (0x7)

#define PWM_REG46_RESERVED_30_31_POS (30)
#define PWM_REG46_RESERVED_30_31_MASK (0x3)

#define PWM_REG47_ADDR (SOC_PWM_REG_BASE + (0x47 << 2))

#define PWM_REG47_TIM1_CNT_POS (0)
#define PWM_REG47_TIM1_CNT_MASK (0xffffffff)

#define PWM_REG48_ADDR (SOC_PWM_REG_BASE + (0x48 << 2))

#define PWM_REG48_TIM2_CNT_POS (0)
#define PWM_REG48_TIM2_CNT_MASK (0xffffffff)

#define PWM_REG49_ADDR (SOC_PWM_REG_BASE + (0x49 << 2))

#define PWM_REG49_TIM3_CNT_POS (0)
#define PWM_REG49_TIM3_CNT_MASK (0xffffffff)

#define PWM_REG4A_ADDR (SOC_PWM_REG_BASE + (0x4a << 2))

#define PWM_REG4A_PSC1_POS (0)
#define PWM_REG4A_PSC1_MASK (0xff)

#define PWM_REG4A_PSC2_POS (8)
#define PWM_REG4A_PSC2_MASK (0xff)

#define PWM_REG4A_PSC3_POS (16)
#define PWM_REG4A_PSC3_MASK (0xff)

#define PWM_REG4A_RESERVED_24_31_POS (24)
#define PWM_REG4A_RESERVED_24_31_MASK (0xff)

#define PWM_REG4B_ADDR (SOC_PWM_REG_BASE + (0x4b << 2))

#define PWM_REG4B_TIM1_ARR_POS (0)
#define PWM_REG4B_TIM1_ARR_MASK (0xffffffff)

#define PWM_REG4C_ADDR (SOC_PWM_REG_BASE + (0x4c << 2))

#define PWM_REG4C_TIM2_ARR_POS (0)
#define PWM_REG4C_TIM2_ARR_MASK (0xffffffff)

#define PWM_REG4D_ADDR (SOC_PWM_REG_BASE + (0x4d << 2))

#define PWM_REG4D_TIM3_ARR_POS (0)
#define PWM_REG4D_TIM3_ARR_MASK (0xffffffff)

#define PWM_REG4E_ADDR (SOC_PWM_REG_BASE + (0x4e << 2))

#define PWM_REG4E_TIM1_RCR_POS (0)
#define PWM_REG4E_TIM1_RCR_MASK (0xffffffff)

#define PWM_REG4F_ADDR (SOC_PWM_REG_BASE + (0x4f << 2))

#define PWM_REG4F_TIM2_RCR_POS (0)
#define PWM_REG4F_TIM2_RCR_MASK (0xffffffff)

#define PWM_REG50_ADDR (SOC_PWM_REG_BASE + (0x50 << 2))

#define PWM_REG50_TIM3_RCR_POS (0)
#define PWM_REG50_TIM3_RCR_MASK (0xffffffff)

#define PWM_REG51_ADDR (SOC_PWM_REG_BASE + (0x51 << 2))

#define PWM_REG51_CCR1_POS (0)
#define PWM_REG51_CCR1_MASK (0xffffffff)

#define PWM_REG52_ADDR (SOC_PWM_REG_BASE + (0x52 << 2))

#define PWM_REG52_CCR2_POS (0)
#define PWM_REG52_CCR2_MASK (0xffffffff)

#define PWM_REG53_ADDR (SOC_PWM_REG_BASE + (0x53 << 2))

#define PWM_REG53_CCR3_POS (0)
#define PWM_REG53_CCR3_MASK (0xffffffff)

#define PWM_REG54_ADDR (SOC_PWM_REG_BASE + (0x54 << 2))

#define PWM_REG54_CCR4_POS (0)
#define PWM_REG54_CCR4_MASK (0xffffffff)

#define PWM_REG55_ADDR (SOC_PWM_REG_BASE + (0x55 << 2))

