Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/pwm_reg.h
#define PWM_REG55_CCR5_POS (0)
#define PWM_REG55_CCR5_MASK (0xffffffff)

#define PWM_REG56_ADDR (SOC_PWM_REG_BASE + (0x56 << 2))

#define PWM_REG56_CCR6_POS (0)
#define PWM_REG56_CCR6_MASK (0xffffffff)

#define PWM_REG57_ADDR (SOC_PWM_REG_BASE + (0x57 << 2))

#define PWM_REG57_CCR7_POS (0)
#define PWM_REG57_CCR7_MASK (0xffffffff)

#define PWM_REG58_ADDR (SOC_PWM_REG_BASE + (0x58 << 2))

#define PWM_REG58_CCR8_POS (0)
#define PWM_REG58_CCR8_MASK (0xffffffff)

#define PWM_REG59_ADDR (SOC_PWM_REG_BASE + (0x59 << 2))

#define PWM_REG59_CCR9_POS (0)
#define PWM_REG59_CCR9_MASK (0xffffffff)

#define PWM_REG5A_ADDR (SOC_PWM_REG_BASE + (0x5a << 2))

#define PWM_REG5A_DT1_POS (0)
#define PWM_REG5A_DT1_MASK (0x3ff)

#define PWM_REG5A_DT2_POS (10)
#define PWM_REG5A_DT2_MASK (0x3ff)

#define PWM_REG5A_DT3_POS (20)
#define PWM_REG5A_DT3_MASK (0x3ff)

#define PWM_REG5A_RESERVED_30_31_POS (30)
#define PWM_REG5A_RESERVED_30_31_MASK (0x3)

#define PWM_REG5B_ADDR (SOC_PWM_REG_BASE + (0x5b << 2))

#define PWM_REG5B_TIM1_ARR_SHAD_POS (0)
#define PWM_REG5B_TIM1_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG5C_ADDR (SOC_PWM_REG_BASE + (0x5c << 2))

#define PWM_REG5C_TIM2_ARR_SHAD_POS (0)
#define PWM_REG5C_TIM2_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG5D_ADDR (SOC_PWM_REG_BASE + (0x5d << 2))

#define PWM_REG5D_TIM3_ARR_SHAD_POS (0)
#define PWM_REG5D_TIM3_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG5E_ADDR (SOC_PWM_REG_BASE + (0x5e << 2))

#define PWM_REG5E_TIM1_RCR_SHAD_POS (0)
#define PWM_REG5E_TIM1_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG5F_ADDR (SOC_PWM_REG_BASE + (0x5f << 2))

#define PWM_REG5F_TIM2_RCR_SHAD_POS (0)
#define PWM_REG5F_TIM2_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG60_ADDR (SOC_PWM_REG_BASE + (0x60 << 2))

#define PWM_REG60_TIM3_RCR_SHAD_POS (0)
#define PWM_REG60_TIM3_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG61_ADDR (SOC_PWM_REG_BASE + (0x61 << 2))

#define PWM_REG61_CCR1_SHAD_POS (0)
#define PWM_REG61_CCR1_SHAD_MASK (0xffffffff)

#define PWM_REG62_ADDR (SOC_PWM_REG_BASE + (0x62 << 2))

#define PWM_REG62_CCR2_SHAD_POS (0)
#define PWM_REG62_CCR2_SHAD_MASK (0xffffffff)

#define PWM_REG63_ADDR (SOC_PWM_REG_BASE + (0x63 << 2))

#define PWM_REG63_CCR3_SHAD_POS (0)
#define PWM_REG63_CCR3_SHAD_MASK (0xffffffff)

#define PWM_REG64_ADDR (SOC_PWM_REG_BASE + (0x64 << 2))

#define PWM_REG64_CCR4_SHAD_POS (0)
#define PWM_REG64_CCR4_SHAD_MASK (0xffffffff)

#define PWM_REG65_ADDR (SOC_PWM_REG_BASE + (0x65 << 2))

#define PWM_REG65_CCR5_SHAD_POS (0)
#define PWM_REG65_CCR5_SHAD_MASK (0xffffffff)

#define PWM_REG66_ADDR (SOC_PWM_REG_BASE + (0x66 << 2))

#define PWM_REG66_CCR6_SHAD_POS (0)
#define PWM_REG66_CCR6_SHAD_MASK (0xffffffff)

#define PWM_REG67_ADDR (SOC_PWM_REG_BASE + (0x67 << 2))

#define PWM_REG67_CCR7_SHAD_POS (0)
#define PWM_REG67_CCR7_SHAD_MASK (0xffffffff)

#define PWM_REG68_ADDR (SOC_PWM_REG_BASE + (0x68 << 2))

#define PWM_REG68_CCR8_SHAD_POS (0)
#define PWM_REG68_CCR8_SHAD_MASK (0xffffffff)

#define PWM_REG69_ADDR (SOC_PWM_REG_BASE + (0x69 << 2))

#define PWM_REG69_CCR9_SHAD_POS (0)
#define PWM_REG69_CCR9_SHAD_MASK (0xffffffff)

#define PWM_REG6A_ADDR (SOC_PWM_REG_BASE + (0x6a << 2))

#define PWM_REG6A_CH6E_SHAD_POS (0)
#define PWM_REG6A_CH6E_SHAD_MASK (0x1)

#define PWM_REG6A_CH5E_SHAD_POS (1)
#define PWM_REG6A_CH5E_SHAD_MASK (0x1)

#define PWM_REG6A_CH4E_SHAD_POS (2)
#define PWM_REG6A_CH4E_SHAD_MASK (0x1)

#define PWM_REG6A_CH3E_SHAD_POS (3)
#define PWM_REG6A_CH3E_SHAD_MASK (0x1)

#define PWM_REG6A_CH2E_SHAD_POS (4)
#define PWM_REG6A_CH2E_SHAD_MASK (0x1)

#define PWM_REG6A_CH1E_SHAD_POS (5)
#define PWM_REG6A_CH1E_SHAD_MASK (0x1)

#define PWM_REG6A_OC1M_SHAD_POS (6)
#define PWM_REG6A_OC1M_SHAD_MASK (0x7)

#define PWM_REG6A_OC2M_SHAD_POS (9)
#define PWM_REG6A_OC2M_SHAD_MASK (0x7)

#define PWM_REG6A_OC3M_SHAD_POS (12)
#define PWM_REG6A_OC3M_SHAD_MASK (0x7)

#define PWM_REG6A_RESERVED_15_31_POS (15)
#define PWM_REG6A_RESERVED_15_31_MASK (0x1ffff)

#define PWM_REG80_ADDR (SOC_PWM_REG_BASE + (0x80 << 2))

#define PWM_REG80_OCM3PE_POS (0)
#define PWM_REG80_OCM3PE_MASK (0x1)

#define PWM_REG80_OCM2PE_POS (1)
#define PWM_REG80_OCM2PE_MASK (0x1)

#define PWM_REG80_OCM1PE_POS (2)
#define PWM_REG80_OCM1PE_MASK (0x1)

#define PWM_REG80_ARPE3_POS (3)
#define PWM_REG80_ARPE3_MASK (0x1)

#define PWM_REG80_ARPE2_POS (4)
#define PWM_REG80_ARPE2_MASK (0x1)

#define PWM_REG80_ARPE1_POS (5)
#define PWM_REG80_ARPE1_MASK (0x1)

#define PWM_REG80_OC3PE_POS (6)
#define PWM_REG80_OC3PE_MASK (0x1)

#define PWM_REG80_OC2PE_POS (7)
#define PWM_REG80_OC2PE_MASK (0x1)

#define PWM_REG80_OC1PE_POS (8)
#define PWM_REG80_OC1PE_MASK (0x1)

#define PWM_REG80_RESERVED_9_17_POS (9)
#define PWM_REG80_RESERVED_9_17_MASK (0x1ff)

#define PWM_REG80_CMS_TIM3_POS (18)
#define PWM_REG80_CMS_TIM3_MASK (0x3)

#define PWM_REG80_CMS_TIM2_POS (20)
#define PWM_REG80_CMS_TIM2_MASK (0x3)

#define PWM_REG80_CMS_TIM1_POS (22)
#define PWM_REG80_CMS_TIM1_MASK (0x3)

#define PWM_REG80_RESERVED_24_25_POS (24)
#define PWM_REG80_RESERVED_24_25_MASK (0x3)

#define PWM_REG80_URS3_POS (26)
#define PWM_REG80_URS3_MASK (0x1)

#define PWM_REG80_URS2_POS (27)
#define PWM_REG80_URS2_MASK (0x1)

#define PWM_REG80_URS1_POS (28)
#define PWM_REG80_URS1_MASK (0x1)

#define PWM_REG80_DIR_TIM3_POS (29)
#define PWM_REG80_DIR_TIM3_MASK (0x1)

#define PWM_REG80_DIR_TIM2_POS (30)
#define PWM_REG80_DIR_TIM2_MASK (0x1)

#define PWM_REG80_DIR_TIM1_POS (31)
#define PWM_REG80_DIR_TIM1_MASK (0x1)

#define PWM_REG81_ADDR (SOC_PWM_REG_BASE + (0x81 << 2))

#define PWM_REG81_RESERVED_0_7_POS (0)
#define PWM_REG81_RESERVED_0_7_MASK (0xff)

#define PWM_REG81_COM_MODE_POS (8)
#define PWM_REG81_COM_MODE_MASK (0x1)

#define PWM_REG81_CCPC_POS (9)
#define PWM_REG81_CCPC_MASK (0x1)

#define PWM_REG81_TRIOS3_POS (10)
#define PWM_REG81_TRIOS3_MASK (0x7)

#define PWM_REG81_ADCS3_POS (13)
#define PWM_REG81_ADCS3_MASK (0x7)

#define PWM_REG81_RESERVED_16_16_POS (16)
#define PWM_REG81_RESERVED_16_16_MASK (0x1)

