Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/pwm_reg.h
#define PWM_REG81_CCUS_POS (17)
#define PWM_REG81_CCUS_MASK (0x1)

#define PWM_REG81_TRIOS2_POS (18)
#define PWM_REG81_TRIOS2_MASK (0x7)

#define PWM_REG81_ADCS2_POS (21)
#define PWM_REG81_ADCS2_MASK (0x7)

#define PWM_REG81_RESERVED_24_25_POS (24)
#define PWM_REG81_RESERVED_24_25_MASK (0x3)

#define PWM_REG81_TRIOS1_POS (26)
#define PWM_REG81_TRIOS1_MASK (0x7)

#define PWM_REG81_ADCS1_POS (29)
#define PWM_REG81_ADCS1_MASK (0x7)

#define PWM_REG82_ADDR (SOC_PWM_REG_BASE + (0x82 << 2))

#define PWM_REG82_SMS1_POS (0)
#define PWM_REG82_SMS1_MASK (0xf)

#define PWM_REG82_SMS2_POS (4)
#define PWM_REG82_SMS2_MASK (0xf)

#define PWM_REG82_SMS3_POS (8)
#define PWM_REG82_SMS3_MASK (0xf)

#define PWM_REG82_TS1_POS (12)
#define PWM_REG82_TS1_MASK (0x7)

#define PWM_REG82_RESERVED_15_15_POS (15)
#define PWM_REG82_RESERVED_15_15_MASK (0x1)

#define PWM_REG82_TS2_POS (16)
#define PWM_REG82_TS2_MASK (0x7)

#define PWM_REG82_TS3_POS (19)
#define PWM_REG82_TS3_MASK (0x7)

#define PWM_REG82_RESERVED_22_31_POS (22)
#define PWM_REG82_RESERVED_22_31_MASK (0x3ff)

#define PWM_REG83_ADDR (SOC_PWM_REG_BASE + (0x83 << 2))

#define PWM_REG83_CC1IE_POS (0)
#define PWM_REG83_CC1IE_MASK (0x1)

#define PWM_REG83_CC2IE_POS (1)
#define PWM_REG83_CC2IE_MASK (0x1)

#define PWM_REG83_CC3IE_POS (2)
#define PWM_REG83_CC3IE_MASK (0x1)

#define PWM_REG83_CC4IE_POS (3)
#define PWM_REG83_CC4IE_MASK (0x1)

#define PWM_REG83_CC5IE_POS (4)
#define PWM_REG83_CC5IE_MASK (0x1)

#define PWM_REG83_CC6IE_POS (5)
#define PWM_REG83_CC6IE_MASK (0x1)

#define PWM_REG83_CC7IE_POS (6)
#define PWM_REG83_CC7IE_MASK (0x1)

#define PWM_REG83_CC8IE_POS (7)
#define PWM_REG83_CC8IE_MASK (0x1)

#define PWM_REG83_CC9IE_POS (8)
#define PWM_REG83_CC9IE_MASK (0x1)

#define PWM_REG83_UIE1_POS (9)
#define PWM_REG83_UIE1_MASK (0x1)

#define PWM_REG83_UIE2_POS (10)
#define PWM_REG83_UIE2_MASK (0x1)

#define PWM_REG83_UIE3_POS (11)
#define PWM_REG83_UIE3_MASK (0x1)

#define PWM_REG83_TIE1_POS (12)
#define PWM_REG83_TIE1_MASK (0x1)

#define PWM_REG83_TIE2_POS (13)
#define PWM_REG83_TIE2_MASK (0x1)

#define PWM_REG83_TIE3_POS (14)
#define PWM_REG83_TIE3_MASK (0x1)

#define PWM_REG83_COMIE_POS (15)
#define PWM_REG83_COMIE_MASK (0x1)

#define PWM_REG83_RESERVED_16_19_POS (16)
#define PWM_REG83_RESERVED_16_19_MASK (0xf)

#define PWM_REG83_DF_TIM1_POS (20)
#define PWM_REG83_DF_TIM1_MASK (0xf)

#define PWM_REG83_DF_TIM2_POS (24)
#define PWM_REG83_DF_TIM2_MASK (0xf)

#define PWM_REG83_DF_TIM3_POS (28)
#define PWM_REG83_DF_TIM3_MASK (0xf)

#define PWM_REG84_ADDR (SOC_PWM_REG_BASE + (0x84 << 2))

#define PWM_REG84_CC1IF_POS (0)
#define PWM_REG84_CC1IF_MASK (0x1)

#define PWM_REG84_CC2IF_POS (1)
#define PWM_REG84_CC2IF_MASK (0x1)

#define PWM_REG84_CC3IF_POS (2)
#define PWM_REG84_CC3IF_MASK (0x1)

#define PWM_REG84_CC4IF_POS (3)
#define PWM_REG84_CC4IF_MASK (0x1)

#define PWM_REG84_CC5IF_POS (4)
#define PWM_REG84_CC5IF_MASK (0x1)

#define PWM_REG84_CC6IF_POS (5)
#define PWM_REG84_CC6IF_MASK (0x1)

#define PWM_REG84_CC7IF_POS (6)
#define PWM_REG84_CC7IF_MASK (0x1)

#define PWM_REG84_CC8IF_POS (7)
#define PWM_REG84_CC8IF_MASK (0x1)

#define PWM_REG84_CC9IF_POS (8)
#define PWM_REG84_CC9IF_MASK (0x1)

#define PWM_REG84_UIF1_POS (9)
#define PWM_REG84_UIF1_MASK (0x1)

#define PWM_REG84_UIF2_POS (10)
#define PWM_REG84_UIF2_MASK (0x1)

#define PWM_REG84_UIF3_POS (11)
#define PWM_REG84_UIF3_MASK (0x1)

#define PWM_REG84_TIF1_POS (12)
#define PWM_REG84_TIF1_MASK (0x1)

#define PWM_REG84_TIF2_POS (13)
#define PWM_REG84_TIF2_MASK (0x1)

#define PWM_REG84_TIF3_POS (14)
#define PWM_REG84_TIF3_MASK (0x1)

#define PWM_REG84_COMIF_POS (15)
#define PWM_REG84_COMIF_MASK (0x1)

#define PWM_REG84_RESERVED_16_31_POS (16)
#define PWM_REG84_RESERVED_16_31_MASK (0xffff)

#define PWM_REG85_ADDR (SOC_PWM_REG_BASE + (0x85 << 2))

#define PWM_REG85_RESERVED_0_8_POS (0)
#define PWM_REG85_RESERVED_0_8_MASK (0x1ff)

#define PWM_REG85_UG1_POS (9)
#define PWM_REG85_UG1_MASK (0x1)

#define PWM_REG85_UG2_POS (10)
#define PWM_REG85_UG2_MASK (0x1)

#define PWM_REG85_UG3_POS (11)
#define PWM_REG85_UG3_MASK (0x1)

#define PWM_REG85_TG1_POS (12)
#define PWM_REG85_TG1_MASK (0x1)

#define PWM_REG85_TG2_POS (13)
#define PWM_REG85_TG2_MASK (0x1)

#define PWM_REG85_TG3_POS (14)
#define PWM_REG85_TG3_MASK (0x1)

#define PWM_REG85_COMG_POS (15)
#define PWM_REG85_COMG_MASK (0x1)

#define PWM_REG85_DTM1_POS (16)
#define PWM_REG85_DTM1_MASK (0x3)

#define PWM_REG85_DTM2_POS (18)
#define PWM_REG85_DTM2_MASK (0x3)

#define PWM_REG85_DTM3_POS (20)
#define PWM_REG85_DTM3_MASK (0x3)

#define PWM_REG85_RESERVED_22_31_POS (22)
#define PWM_REG85_RESERVED_22_31_MASK (0x3ff)

#define PWM_REG86_ADDR (SOC_PWM_REG_BASE + (0x86 << 2))

#define PWM_REG86_CH1P_POS (0)
#define PWM_REG86_CH1P_MASK (0x3)

#define PWM_REG86_CH2P_POS (2)
#define PWM_REG86_CH2P_MASK (0x3)

#define PWM_REG86_CH3P_POS (4)
#define PWM_REG86_CH3P_MASK (0x3)

#define PWM_REG86_CH4P_POS (6)
#define PWM_REG86_CH4P_MASK (0x3)

#define PWM_REG86_CH5P_POS (8)
#define PWM_REG86_CH5P_MASK (0x3)

#define PWM_REG86_CH6P_POS (10)
#define PWM_REG86_CH6P_MASK (0x3)

#define PWM_REG86_CH1E_POS (12)
#define PWM_REG86_CH1E_MASK (0x1)

#define PWM_REG86_CH2E_POS (13)
#define PWM_REG86_CH2E_MASK (0x1)

#define PWM_REG86_CH3E_POS (14)
#define PWM_REG86_CH3E_MASK (0x1)

#define PWM_REG86_CH4E_POS (15)
#define PWM_REG86_CH4E_MASK (0x1)

#define PWM_REG86_CH5E_POS (16)
#define PWM_REG86_CH5E_MASK (0x1)

#define PWM_REG86_CH6E_POS (17)
#define PWM_REG86_CH6E_MASK (0x1)

#define PWM_REG86_TIM1CCM_POS (18)
#define PWM_REG86_TIM1CCM_MASK (0x1)

#define PWM_REG86_TIM2CCM_POS (19)
#define PWM_REG86_TIM2CCM_MASK (0x1)

#define PWM_REG86_TIM3CCM_POS (20)
#define PWM_REG86_TIM3CCM_MASK (0x1)

#define PWM_REG86_OC1M_POS (21)
#define PWM_REG86_OC1M_MASK (0x7)

#define PWM_REG86_OC2M_POS (24)
#define PWM_REG86_OC2M_MASK (0x7)

