Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/pwm_reg.h
#define PWM_REG86_OC3M_POS (27)
#define PWM_REG86_OC3M_MASK (0x7)

#define PWM_REG86_RESERVED_30_31_POS (30)
#define PWM_REG86_RESERVED_30_31_MASK (0x3)

#define PWM_REG87_ADDR (SOC_PWM_REG_BASE + (0x87 << 2))

#define PWM_REG87_TIM1_CNT_POS (0)
#define PWM_REG87_TIM1_CNT_MASK (0xffffffff)

#define PWM_REG88_ADDR (SOC_PWM_REG_BASE + (0x88 << 2))

#define PWM_REG88_TIM2_CNT_POS (0)
#define PWM_REG88_TIM2_CNT_MASK (0xffffffff)

#define PWM_REG89_ADDR (SOC_PWM_REG_BASE + (0x89 << 2))

#define PWM_REG89_TIM3_CNT_POS (0)
#define PWM_REG89_TIM3_CNT_MASK (0xffffffff)

#define PWM_REG8A_ADDR (SOC_PWM_REG_BASE + (0x8a << 2))

#define PWM_REG8A_PSC1_POS (0)
#define PWM_REG8A_PSC1_MASK (0xff)

#define PWM_REG8A_PSC2_POS (8)
#define PWM_REG8A_PSC2_MASK (0xff)

#define PWM_REG8A_PSC3_POS (16)
#define PWM_REG8A_PSC3_MASK (0xff)

#define PWM_REG8A_RESERVED_24_31_POS (24)
#define PWM_REG8A_RESERVED_24_31_MASK (0xff)

#define PWM_REG8B_ADDR (SOC_PWM_REG_BASE + (0x8b << 2))

#define PWM_REG8B_TIM1_ARR_POS (0)
#define PWM_REG8B_TIM1_ARR_MASK (0xffffffff)

#define PWM_REG8C_ADDR (SOC_PWM_REG_BASE + (0x8c << 2))

#define PWM_REG8C_TIM2_ARR_POS (0)
#define PWM_REG8C_TIM2_ARR_MASK (0xffffffff)

#define PWM_REG8D_ADDR (SOC_PWM_REG_BASE + (0x8d << 2))

#define PWM_REG8D_TIM3_ARR_POS (0)
#define PWM_REG8D_TIM3_ARR_MASK (0xffffffff)

#define PWM_REG8E_ADDR (SOC_PWM_REG_BASE + (0x8e << 2))

#define PWM_REG8E_TIM1_RCR_POS (0)
#define PWM_REG8E_TIM1_RCR_MASK (0xffffffff)

#define PWM_REG8F_ADDR (SOC_PWM_REG_BASE + (0x8f << 2))

#define PWM_REG8F_TIM2_RCR_POS (0)
#define PWM_REG8F_TIM2_RCR_MASK (0xffffffff)

#define PWM_REG90_ADDR (SOC_PWM_REG_BASE + (0x90 << 2))

#define PWM_REG90_TIM3_RCR_POS (0)
#define PWM_REG90_TIM3_RCR_MASK (0xffffffff)

#define PWM_REG91_ADDR (SOC_PWM_REG_BASE + (0x91 << 2))

#define PWM_REG91_CCR1_POS (0)
#define PWM_REG91_CCR1_MASK (0xffffffff)

#define PWM_REG92_ADDR (SOC_PWM_REG_BASE + (0x92 << 2))

#define PWM_REG92_CCR2_POS (0)
#define PWM_REG92_CCR2_MASK (0xffffffff)

#define PWM_REG93_ADDR (SOC_PWM_REG_BASE + (0x93 << 2))

#define PWM_REG93_CCR3_POS (0)
#define PWM_REG93_CCR3_MASK (0xffffffff)

#define PWM_REG94_ADDR (SOC_PWM_REG_BASE + (0x94 << 2))

#define PWM_REG94_CCR4_POS (0)
#define PWM_REG94_CCR4_MASK (0xffffffff)

#define PWM_REG95_ADDR (SOC_PWM_REG_BASE + (0x95 << 2))

#define PWM_REG95_CCR5_POS (0)
#define PWM_REG95_CCR5_MASK (0xffffffff)

#define PWM_REG96_ADDR (SOC_PWM_REG_BASE + (0x96 << 2))

#define PWM_REG96_CCR6_POS (0)
#define PWM_REG96_CCR6_MASK (0xffffffff)

#define PWM_REG97_ADDR (SOC_PWM_REG_BASE + (0x97 << 2))

#define PWM_REG97_CCR7_POS (0)
#define PWM_REG97_CCR7_MASK (0xffffffff)

#define PWM_REG98_ADDR (SOC_PWM_REG_BASE + (0x98 << 2))

#define PWM_REG98_CCR8_POS (0)
#define PWM_REG98_CCR8_MASK (0xffffffff)

#define PWM_REG99_ADDR (SOC_PWM_REG_BASE + (0x99 << 2))

#define PWM_REG99_CCR9_POS (0)
#define PWM_REG99_CCR9_MASK (0xffffffff)

#define PWM_REG9A_ADDR (SOC_PWM_REG_BASE + (0x9a << 2))

#define PWM_REG9A_DT1_POS (0)
#define PWM_REG9A_DT1_MASK (0x3ff)

#define PWM_REG9A_DT2_POS (10)
#define PWM_REG9A_DT2_MASK (0x3ff)

#define PWM_REG9A_DT3_POS (20)
#define PWM_REG9A_DT3_MASK (0x3ff)

#define PWM_REG9A_RESERVED_30_31_POS (30)
#define PWM_REG9A_RESERVED_30_31_MASK (0x3)

#define PWM_REG9B_ADDR (SOC_PWM_REG_BASE + (0x9b << 2))

#define PWM_REG9B_TIM1_ARR_SHAD_POS (0)
#define PWM_REG9B_TIM1_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG9C_ADDR (SOC_PWM_REG_BASE + (0x9c << 2))

#define PWM_REG9C_TIM2_ARR_SHAD_POS (0)
#define PWM_REG9C_TIM2_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG9D_ADDR (SOC_PWM_REG_BASE + (0x9d << 2))

#define PWM_REG9D_TIM3_ARR_SHAD_POS (0)
#define PWM_REG9D_TIM3_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG9E_ADDR (SOC_PWM_REG_BASE + (0x9e << 2))

#define PWM_REG9E_TIM1_RCR_SHAD_POS (0)
#define PWM_REG9E_TIM1_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG9F_ADDR (SOC_PWM_REG_BASE + (0x9f << 2))

#define PWM_REG9F_TIM2_RCR_SHAD_POS (0)
#define PWM_REG9F_TIM2_RCR_SHAD_MASK (0xffffffff)

#define PWM_REGA0_ADDR (SOC_PWM_REG_BASE + (0xa0 << 2))

#define PWM_REGA0_TIM3_RCR_SHAD_POS (0)
#define PWM_REGA0_TIM3_RCR_SHAD_MASK (0xffffffff)

#define PWM_REGA1_ADDR (SOC_PWM_REG_BASE + (0xa1 << 2))

#define PWM_REGA1_CCR1_SHAD_POS (0)
#define PWM_REGA1_CCR1_SHAD_MASK (0xffffffff)

#define PWM_REGA2_ADDR (SOC_PWM_REG_BASE + (0xa2 << 2))

#define PWM_REGA2_CCR2_SHAD_POS (0)
#define PWM_REGA2_CCR2_SHAD_MASK (0xffffffff)

#define PWM_REGA3_ADDR (SOC_PWM_REG_BASE + (0xa3 << 2))

#define PWM_REGA3_CCR3_SHAD_POS (0)
#define PWM_REGA3_CCR3_SHAD_MASK (0xffffffff)

#define PWM_REGA4_ADDR (SOC_PWM_REG_BASE + (0xa4 << 2))

#define PWM_REGA4_CCR4_SHAD_POS (0)
#define PWM_REGA4_CCR4_SHAD_MASK (0xffffffff)

#define PWM_REGA5_ADDR (SOC_PWM_REG_BASE + (0xa5 << 2))

#define PWM_REGA5_CCR5_SHAD_POS (0)
#define PWM_REGA5_CCR5_SHAD_MASK (0xffffffff)

#define PWM_REGA6_ADDR (SOC_PWM_REG_BASE + (0xa6 << 2))

#define PWM_REGA6_CCR6_SHAD_POS (0)
#define PWM_REGA6_CCR6_SHAD_MASK (0xffffffff)

#define PWM_REGA7_ADDR (SOC_PWM_REG_BASE + (0xa7 << 2))

#define PWM_REGA7_CCR7_SHAD_POS (0)
#define PWM_REGA7_CCR7_SHAD_MASK (0xffffffff)

#define PWM_REGA8_ADDR (SOC_PWM_REG_BASE + (0xa8 << 2))

#define PWM_REGA8_CCR8_SHAD_POS (0)
#define PWM_REGA8_CCR8_SHAD_MASK (0xffffffff)

#define PWM_REGA9_ADDR (SOC_PWM_REG_BASE + (0xa9 << 2))

#define PWM_REGA9_CCR9_SHAD_POS (0)
#define PWM_REGA9_CCR9_SHAD_MASK (0xffffffff)

#define PWM_REGAA_ADDR (SOC_PWM_REG_BASE + (0xaa << 2))

#define PWM_REGAA_CH6E_SHAD_POS (0)
#define PWM_REGAA_CH6E_SHAD_MASK (0x1)

#define PWM_REGAA_CH5E_SHAD_POS (1)
#define PWM_REGAA_CH5E_SHAD_MASK (0x1)

#define PWM_REGAA_CH4E_SHAD_POS (2)
#define PWM_REGAA_CH4E_SHAD_MASK (0x1)

#define PWM_REGAA_CH3E_SHAD_POS (3)
#define PWM_REGAA_CH3E_SHAD_MASK (0x1)

#define PWM_REGAA_CH2E_SHAD_POS (4)
#define PWM_REGAA_CH2E_SHAD_MASK (0x1)

