Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/pwm_reg.h
#define PWM_REGC4_TIF2_POS (13)
#define PWM_REGC4_TIF2_MASK (0x1)

#define PWM_REGC4_TIF3_POS (14)
#define PWM_REGC4_TIF3_MASK (0x1)

#define PWM_REGC4_COMIF_POS (15)
#define PWM_REGC4_COMIF_MASK (0x1)

#define PWM_REGC4_RESERVED_16_31_POS (16)
#define PWM_REGC4_RESERVED_16_31_MASK (0xffff)

#define PWM_REGC5_ADDR (SOC_PWM_REG_BASE + (0xc5 << 2))

#define PWM_REGC5_RESERVED_0_8_POS (0)
#define PWM_REGC5_RESERVED_0_8_MASK (0x1ff)

#define PWM_REGC5_UG1_POS (9)
#define PWM_REGC5_UG1_MASK (0x1)

#define PWM_REGC5_UG2_POS (10)
#define PWM_REGC5_UG2_MASK (0x1)

#define PWM_REGC5_UG3_POS (11)
#define PWM_REGC5_UG3_MASK (0x1)

#define PWM_REGC5_TG1_POS (12)
#define PWM_REGC5_TG1_MASK (0x1)

#define PWM_REGC5_TG2_POS (13)
#define PWM_REGC5_TG2_MASK (0x1)

#define PWM_REGC5_TG3_POS (14)
#define PWM_REGC5_TG3_MASK (0x1)

#define PWM_REGC5_COMG_POS (15)
#define PWM_REGC5_COMG_MASK (0x1)

#define PWM_REGC5_DTM1_POS (16)
#define PWM_REGC5_DTM1_MASK (0x3)

#define PWM_REGC5_DTM2_POS (18)
#define PWM_REGC5_DTM2_MASK (0x3)

#define PWM_REGC5_DTM3_POS (20)
#define PWM_REGC5_DTM3_MASK (0x3)

#define PWM_REGC5_RESERVED_22_31_POS (22)
#define PWM_REGC5_RESERVED_22_31_MASK (0x3ff)

#define PWM_REGC6_ADDR (SOC_PWM_REG_BASE + (0xc6 << 2))

#define PWM_REGC6_CH1P_POS (0)
#define PWM_REGC6_CH1P_MASK (0x3)

#define PWM_REGC6_CH2P_POS (2)
#define PWM_REGC6_CH2P_MASK (0x3)

#define PWM_REGC6_CH3P_POS (4)
#define PWM_REGC6_CH3P_MASK (0x3)

#define PWM_REGC6_CH4P_POS (6)
#define PWM_REGC6_CH4P_MASK (0x3)

#define PWM_REGC6_CH5P_POS (8)
#define PWM_REGC6_CH5P_MASK (0x3)

#define PWM_REGC6_CH6P_POS (10)
#define PWM_REGC6_CH6P_MASK (0x3)

#define PWM_REGC6_CH1E_POS (12)
#define PWM_REGC6_CH1E_MASK (0x1)

#define PWM_REGC6_CH2E_POS (13)
#define PWM_REGC6_CH2E_MASK (0x1)

#define PWM_REGC6_CH3E_POS (14)
#define PWM_REGC6_CH3E_MASK (0x1)

#define PWM_REGC6_CH4E_POS (15)
#define PWM_REGC6_CH4E_MASK (0x1)

#define PWM_REGC6_CH5E_POS (16)
#define PWM_REGC6_CH5E_MASK (0x1)

#define PWM_REGC6_CH6E_POS (17)
#define PWM_REGC6_CH6E_MASK (0x1)

#define PWM_REGC6_TIM1CCM_POS (18)
#define PWM_REGC6_TIM1CCM_MASK (0x1)

#define PWM_REGC6_TIM2CCM_POS (19)
#define PWM_REGC6_TIM2CCM_MASK (0x1)

#define PWM_REGC6_TIM3CCM_POS (20)
#define PWM_REGC6_TIM3CCM_MASK (0x1)

#define PWM_REGC6_OC1M_POS (21)
#define PWM_REGC6_OC1M_MASK (0x7)

#define PWM_REGC6_OC2M_POS (24)
#define PWM_REGC6_OC2M_MASK (0x7)

#define PWM_REGC6_OC3M_POS (27)
#define PWM_REGC6_OC3M_MASK (0x7)

#define PWM_REGC6_RESERVED_30_31_POS (30)
#define PWM_REGC6_RESERVED_30_31_MASK (0x3)

#define PWM_REGC7_ADDR (SOC_PWM_REG_BASE + (0xc7 << 2))

#define PWM_REGC7_TIM1_CNT_POS (0)
#define PWM_REGC7_TIM1_CNT_MASK (0xffffffff)

#define PWM_REGC8_ADDR (SOC_PWM_REG_BASE + (0xc8 << 2))

#define PWM_REGC8_TIM2_CNT_POS (0)
#define PWM_REGC8_TIM2_CNT_MASK (0xffffffff)

#define PWM_REGC9_ADDR (SOC_PWM_REG_BASE + (0xc9 << 2))

#define PWM_REGC9_TIM3_CNT_POS (0)
#define PWM_REGC9_TIM3_CNT_MASK (0xffffffff)

#define PWM_REGCA_ADDR (SOC_PWM_REG_BASE + (0xca << 2))

#define PWM_REGCA_PSC1_POS (0)
#define PWM_REGCA_PSC1_MASK (0xff)

#define PWM_REGCA_PSC2_POS (8)
#define PWM_REGCA_PSC2_MASK (0xff)

#define PWM_REGCA_PSC3_POS (16)
#define PWM_REGCA_PSC3_MASK (0xff)

#define PWM_REGCA_RESERVED_24_31_POS (24)
#define PWM_REGCA_RESERVED_24_31_MASK (0xff)

#define PWM_REGCB_ADDR (SOC_PWM_REG_BASE + (0xcb << 2))

#define PWM_REGCB_TIM1_ARR_POS (0)
#define PWM_REGCB_TIM1_ARR_MASK (0xffffffff)

#define PWM_REGCC_ADDR (SOC_PWM_REG_BASE + (0xcc << 2))

#define PWM_REGCC_TIM2_ARR_POS (0)
#define PWM_REGCC_TIM2_ARR_MASK (0xffffffff)

#define PWM_REGCD_ADDR (SOC_PWM_REG_BASE + (0xcd << 2))

#define PWM_REGCD_TIM3_ARR_POS (0)
#define PWM_REGCD_TIM3_ARR_MASK (0xffffffff)

#define PWM_REGCE_ADDR (SOC_PWM_REG_BASE + (0xce << 2))

#define PWM_REGCE_TIM1_RCR_POS (0)
#define PWM_REGCE_TIM1_RCR_MASK (0xffffffff)

#define PWM_REGCF_ADDR (SOC_PWM_REG_BASE + (0xcf << 2))

#define PWM_REGCF_TIM2_RCR_POS (0)
#define PWM_REGCF_TIM2_RCR_MASK (0xffffffff)

#define PWM_REGD0_ADDR (SOC_PWM_REG_BASE + (0xd0 << 2))

#define PWM_REGD0_TIM3_RCR_POS (0)
#define PWM_REGD0_TIM3_RCR_MASK (0xffffffff)

#define PWM_REGD1_ADDR (SOC_PWM_REG_BASE + (0xd1 << 2))

#define PWM_REGD1_CCR1_POS (0)
#define PWM_REGD1_CCR1_MASK (0xffffffff)

#define PWM_REGD2_ADDR (SOC_PWM_REG_BASE + (0xd2 << 2))

#define PWM_REGD2_CCR2_POS (0)
#define PWM_REGD2_CCR2_MASK (0xffffffff)

#define PWM_REGD3_ADDR (SOC_PWM_REG_BASE + (0xd3 << 2))

#define PWM_REGD3_CCR3_POS (0)
#define PWM_REGD3_CCR3_MASK (0xffffffff)

#define PWM_REGD4_ADDR (SOC_PWM_REG_BASE + (0xd4 << 2))

#define PWM_REGD4_CCR4_POS (0)
#define PWM_REGD4_CCR4_MASK (0xffffffff)

#define PWM_REGD5_ADDR (SOC_PWM_REG_BASE + (0xd5 << 2))

#define PWM_REGD5_CCR5_POS (0)
#define PWM_REGD5_CCR5_MASK (0xffffffff)

#define PWM_REGD6_ADDR (SOC_PWM_REG_BASE + (0xd6 << 2))

#define PWM_REGD6_CCR6_POS (0)
#define PWM_REGD6_CCR6_MASK (0xffffffff)

#define PWM_REGD7_ADDR (SOC_PWM_REG_BASE + (0xd7 << 2))

#define PWM_REGD7_CCR7_POS (0)
#define PWM_REGD7_CCR7_MASK (0xffffffff)

#define PWM_REGD8_ADDR (SOC_PWM_REG_BASE + (0xd8 << 2))

#define PWM_REGD8_CCR8_POS (0)
#define PWM_REGD8_CCR8_MASK (0xffffffff)

#define PWM_REGD9_ADDR (SOC_PWM_REG_BASE + (0xd9 << 2))

#define PWM_REGD9_CCR9_POS (0)
#define PWM_REGD9_CCR9_MASK (0xffffffff)

#define PWM_REGDA_ADDR (SOC_PWM_REG_BASE + (0xda << 2))

#define PWM_REGDA_DT1_POS (0)
#define PWM_REGDA_DT1_MASK (0x3ff)

#define PWM_REGDA_DT2_POS (10)
#define PWM_REGDA_DT2_MASK (0x3ff)

#define PWM_REGDA_DT3_POS (20)
#define PWM_REGDA_DT3_MASK (0x3ff)

#define PWM_REGDA_RESERVED_30_31_POS (30)
#define PWM_REGDA_RESERVED_30_31_MASK (0x3)

#define PWM_REGDB_ADDR (SOC_PWM_REG_BASE + (0xdb << 2))

#define PWM_REGDB_TIM1_ARR_SHAD_POS (0)
#define PWM_REGDB_TIM1_ARR_SHAD_MASK (0xffffffff)

#define PWM_REGDC_ADDR (SOC_PWM_REG_BASE + (0xdc << 2))

