Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/pwm_reg.h
#define PWM_REGDC_TIM2_ARR_SHAD_POS (0)
#define PWM_REGDC_TIM2_ARR_SHAD_MASK (0xffffffff)

#define PWM_REGDD_ADDR (SOC_PWM_REG_BASE + (0xdd << 2))

#define PWM_REGDD_TIM3_ARR_SHAD_POS (0)
#define PWM_REGDD_TIM3_ARR_SHAD_MASK (0xffffffff)

#define PWM_REGDE_ADDR (SOC_PWM_REG_BASE + (0xde << 2))

#define PWM_REGDE_TIM1_RCR_SHAD_POS (0)
#define PWM_REGDE_TIM1_RCR_SHAD_MASK (0xffffffff)

#define PWM_REGDF_ADDR (SOC_PWM_REG_BASE + (0xdf << 2))

#define PWM_REGDF_TIM2_RCR_SHAD_POS (0)
#define PWM_REGDF_TIM2_RCR_SHAD_MASK (0xffffffff)

#define PWM_REGE0_ADDR (SOC_PWM_REG_BASE + (0xe0 << 2))

#define PWM_REGE0_TIM3_RCR_SHAD_POS (0)
#define PWM_REGE0_TIM3_RCR_SHAD_MASK (0xffffffff)

#define PWM_REGE1_ADDR (SOC_PWM_REG_BASE + (0xe1 << 2))

#define PWM_REGE1_CCR1_SHAD_POS (0)
#define PWM_REGE1_CCR1_SHAD_MASK (0xffffffff)

#define PWM_REGE2_ADDR (SOC_PWM_REG_BASE + (0xe2 << 2))

#define PWM_REGE2_CCR2_SHAD_POS (0)
#define PWM_REGE2_CCR2_SHAD_MASK (0xffffffff)

#define PWM_REGE3_ADDR (SOC_PWM_REG_BASE + (0xe3 << 2))

#define PWM_REGE3_CCR3_SHAD_POS (0)
#define PWM_REGE3_CCR3_SHAD_MASK (0xffffffff)

#define PWM_REGE4_ADDR (SOC_PWM_REG_BASE + (0xe4 << 2))

#define PWM_REGE4_CCR4_SHAD_POS (0)
#define PWM_REGE4_CCR4_SHAD_MASK (0xffffffff)

#define PWM_REGE5_ADDR (SOC_PWM_REG_BASE + (0xe5 << 2))

#define PWM_REGE5_CCR5_SHAD_POS (0)
#define PWM_REGE5_CCR5_SHAD_MASK (0xffffffff)

#define PWM_REGE6_ADDR (SOC_PWM_REG_BASE + (0xe6 << 2))

#define PWM_REGE6_CCR6_SHAD_POS (0)
#define PWM_REGE6_CCR6_SHAD_MASK (0xffffffff)

#define PWM_REGE7_ADDR (SOC_PWM_REG_BASE + (0xe7 << 2))

#define PWM_REGE7_CCR7_SHAD_POS (0)
#define PWM_REGE7_CCR7_SHAD_MASK (0xffffffff)

#define PWM_REGE8_ADDR (SOC_PWM_REG_BASE + (0xe8 << 2))

#define PWM_REGE8_CCR8_SHAD_POS (0)
#define PWM_REGE8_CCR8_SHAD_MASK (0xffffffff)

#define PWM_REGE9_ADDR (SOC_PWM_REG_BASE + (0xe9 << 2))

#define PWM_REGE9_CCR9_SHAD_POS (0)
#define PWM_REGE9_CCR9_SHAD_MASK (0xffffffff)

#define PWM_REGEA_ADDR (SOC_PWM_REG_BASE + (0xea << 2))

#define PWM_REGEA_CH6E_SHAD_POS (0)
#define PWM_REGEA_CH6E_SHAD_MASK (0x1)

#define PWM_REGEA_CH5E_SHAD_POS (1)
#define PWM_REGEA_CH5E_SHAD_MASK (0x1)

#define PWM_REGEA_CH4E_SHAD_POS (2)
#define PWM_REGEA_CH4E_SHAD_MASK (0x1)

#define PWM_REGEA_CH3E_SHAD_POS (3)
#define PWM_REGEA_CH3E_SHAD_MASK (0x1)

#define PWM_REGEA_CH2E_SHAD_POS (4)
#define PWM_REGEA_CH2E_SHAD_MASK (0x1)

#define PWM_REGEA_CH1E_SHAD_POS (5)
#define PWM_REGEA_CH1E_SHAD_MASK (0x1)

#define PWM_REGEA_OC1M_SHAD_POS (6)
#define PWM_REGEA_OC1M_SHAD_MASK (0x7)

#define PWM_REGEA_OC2M_SHAD_POS (9)
#define PWM_REGEA_OC2M_SHAD_MASK (0x7)

#define PWM_REGEA_OC3M_SHAD_POS (12)
#define PWM_REGEA_OC3M_SHAD_MASK (0x7)

#define PWM_REGEA_RESERVED_15_31_POS (15)
#define PWM_REGEA_RESERVED_15_31_MASK (0x1ffff)

#define PWM_REG100_ADDR (SOC_PWM_REG_BASE + (0x100 << 2))

#define PWM_REG100_OCM3PE_POS (0)
#define PWM_REG100_OCM3PE_MASK (0x1)

#define PWM_REG100_OCM2PE_POS (1)
#define PWM_REG100_OCM2PE_MASK (0x1)

#define PWM_REG100_OCM1PE_POS (2)
#define PWM_REG100_OCM1PE_MASK (0x1)

#define PWM_REG100_ARPE3_POS (3)
#define PWM_REG100_ARPE3_MASK (0x1)

#define PWM_REG100_ARPE2_POS (4)
#define PWM_REG100_ARPE2_MASK (0x1)

#define PWM_REG100_ARPE1_POS (5)
#define PWM_REG100_ARPE1_MASK (0x1)

#define PWM_REG100_OC3PE_POS (6)
#define PWM_REG100_OC3PE_MASK (0x1)

#define PWM_REG100_OC2PE_POS (7)
#define PWM_REG100_OC2PE_MASK (0x1)

#define PWM_REG100_OC1PE_POS (8)
#define PWM_REG100_OC1PE_MASK (0x1)

#define PWM_REG100_RESERVED_9_17_POS (9)
#define PWM_REG100_RESERVED_9_17_MASK (0x1ff)

#define PWM_REG100_CMS_TIM3_POS (18)
#define PWM_REG100_CMS_TIM3_MASK (0x3)

#define PWM_REG100_CMS_TIM2_POS (20)
#define PWM_REG100_CMS_TIM2_MASK (0x3)

#define PWM_REG100_CMS_TIM1_POS (22)
#define PWM_REG100_CMS_TIM1_MASK (0x3)

#define PWM_REG100_RESERVED_24_25_POS (24)
#define PWM_REG100_RESERVED_24_25_MASK (0x3)

#define PWM_REG100_URS3_POS (26)
#define PWM_REG100_URS3_MASK (0x1)

#define PWM_REG100_URS2_POS (27)
#define PWM_REG100_URS2_MASK (0x1)

#define PWM_REG100_URS1_POS (28)
#define PWM_REG100_URS1_MASK (0x1)

#define PWM_REG100_DIR_TIM3_POS (29)
#define PWM_REG100_DIR_TIM3_MASK (0x1)

#define PWM_REG100_DIR_TIM2_POS (30)
#define PWM_REG100_DIR_TIM2_MASK (0x1)

#define PWM_REG100_DIR_TIM1_POS (31)
#define PWM_REG100_DIR_TIM1_MASK (0x1)

#define PWM_REG101_ADDR (SOC_PWM_REG_BASE + (0x101 << 2))

#define PWM_REG101_RESERVED_0_7_POS (0)
#define PWM_REG101_RESERVED_0_7_MASK (0xff)

#define PWM_REG101_COM_MODE_POS (8)
#define PWM_REG101_COM_MODE_MASK (0x1)

#define PWM_REG101_CCPC_POS (9)
#define PWM_REG101_CCPC_MASK (0x1)

#define PWM_REG101_TRIOS3_POS (10)
#define PWM_REG101_TRIOS3_MASK (0x7)

#define PWM_REG101_ADCS3_POS (13)
#define PWM_REG101_ADCS3_MASK (0x7)

#define PWM_REG101_RESERVED_16_16_POS (16)
#define PWM_REG101_RESERVED_16_16_MASK (0x1)

#define PWM_REG101_CCUS_POS (17)
#define PWM_REG101_CCUS_MASK (0x1)

#define PWM_REG101_TRIOS2_POS (18)
#define PWM_REG101_TRIOS2_MASK (0x7)

#define PWM_REG101_ADCS2_POS (21)
#define PWM_REG101_ADCS2_MASK (0x7)

#define PWM_REG101_RESERVED_24_25_POS (24)
#define PWM_REG101_RESERVED_24_25_MASK (0x3)

#define PWM_REG101_TRIOS1_POS (26)
#define PWM_REG101_TRIOS1_MASK (0x7)

#define PWM_REG101_ADCS1_POS (29)
#define PWM_REG101_ADCS1_MASK (0x7)

#define PWM_REG102_ADDR (SOC_PWM_REG_BASE + (0x102 << 2))

#define PWM_REG102_SMS1_POS (0)
#define PWM_REG102_SMS1_MASK (0xf)

#define PWM_REG102_SMS2_POS (4)
#define PWM_REG102_SMS2_MASK (0xf)

#define PWM_REG102_SMS3_POS (8)
#define PWM_REG102_SMS3_MASK (0xf)

#define PWM_REG102_TS1_POS (12)
#define PWM_REG102_TS1_MASK (0x7)

#define PWM_REG102_RESERVED_15_15_POS (15)
#define PWM_REG102_RESERVED_15_15_MASK (0x1)

#define PWM_REG102_TS2_POS (16)
#define PWM_REG102_TS2_MASK (0x7)

#define PWM_REG102_TS3_POS (19)
#define PWM_REG102_TS3_MASK (0x7)

#define PWM_REG102_RESERVED_22_31_POS (22)
#define PWM_REG102_RESERVED_22_31_MASK (0x3ff)

#define PWM_REG103_ADDR (SOC_PWM_REG_BASE + (0x103 << 2))

#define PWM_REG103_CC1IE_POS (0)
#define PWM_REG103_CC1IE_MASK (0x1)

#define PWM_REG103_CC2IE_POS (1)
#define PWM_REG103_CC2IE_MASK (0x1)

#define PWM_REG103_CC3IE_POS (2)
#define PWM_REG103_CC3IE_MASK (0x1)

