Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/pwm_reg.h
#define PWM_REG103_CC4IE_POS (3)
#define PWM_REG103_CC4IE_MASK (0x1)

#define PWM_REG103_CC5IE_POS (4)
#define PWM_REG103_CC5IE_MASK (0x1)

#define PWM_REG103_CC6IE_POS (5)
#define PWM_REG103_CC6IE_MASK (0x1)

#define PWM_REG103_CC7IE_POS (6)
#define PWM_REG103_CC7IE_MASK (0x1)

#define PWM_REG103_CC8IE_POS (7)
#define PWM_REG103_CC8IE_MASK (0x1)

#define PWM_REG103_CC9IE_POS (8)
#define PWM_REG103_CC9IE_MASK (0x1)

#define PWM_REG103_UIE1_POS (9)
#define PWM_REG103_UIE1_MASK (0x1)

#define PWM_REG103_UIE2_POS (10)
#define PWM_REG103_UIE2_MASK (0x1)

#define PWM_REG103_UIE3_POS (11)
#define PWM_REG103_UIE3_MASK (0x1)

#define PWM_REG103_TIE1_POS (12)
#define PWM_REG103_TIE1_MASK (0x1)

#define PWM_REG103_TIE2_POS (13)
#define PWM_REG103_TIE2_MASK (0x1)

#define PWM_REG103_TIE3_POS (14)
#define PWM_REG103_TIE3_MASK (0x1)

#define PWM_REG103_COMIE_POS (15)
#define PWM_REG103_COMIE_MASK (0x1)

#define PWM_REG103_RESERVED_16_19_POS (16)
#define PWM_REG103_RESERVED_16_19_MASK (0xf)

#define PWM_REG103_DF_TIM1_POS (20)
#define PWM_REG103_DF_TIM1_MASK (0xf)

#define PWM_REG103_DF_TIM2_POS (24)
#define PWM_REG103_DF_TIM2_MASK (0xf)

#define PWM_REG103_DF_TIM3_POS (28)
#define PWM_REG103_DF_TIM3_MASK (0xf)

#define PWM_REG104_ADDR (SOC_PWM_REG_BASE + (0x104 << 2))

#define PWM_REG104_CC1IF_POS (0)
#define PWM_REG104_CC1IF_MASK (0x1)

#define PWM_REG104_CC2IF_POS (1)
#define PWM_REG104_CC2IF_MASK (0x1)

#define PWM_REG104_CC3IF_POS (2)
#define PWM_REG104_CC3IF_MASK (0x1)

#define PWM_REG104_CC4IF_POS (3)
#define PWM_REG104_CC4IF_MASK (0x1)

#define PWM_REG104_CC5IF_POS (4)
#define PWM_REG104_CC5IF_MASK (0x1)

#define PWM_REG104_CC6IF_POS (5)
#define PWM_REG104_CC6IF_MASK (0x1)

#define PWM_REG104_CC7IF_POS (6)
#define PWM_REG104_CC7IF_MASK (0x1)

#define PWM_REG104_CC8IF_POS (7)
#define PWM_REG104_CC8IF_MASK (0x1)

#define PWM_REG104_CC9IF_POS (8)
#define PWM_REG104_CC9IF_MASK (0x1)

#define PWM_REG104_UIF1_POS (9)
#define PWM_REG104_UIF1_MASK (0x1)

#define PWM_REG104_UIF2_POS (10)
#define PWM_REG104_UIF2_MASK (0x1)

#define PWM_REG104_UIF3_POS (11)
#define PWM_REG104_UIF3_MASK (0x1)

#define PWM_REG104_TIF1_POS (12)
#define PWM_REG104_TIF1_MASK (0x1)

#define PWM_REG104_TIF2_POS (13)
#define PWM_REG104_TIF2_MASK (0x1)

#define PWM_REG104_TIF3_POS (14)
#define PWM_REG104_TIF3_MASK (0x1)

#define PWM_REG104_COMIF_POS (15)
#define PWM_REG104_COMIF_MASK (0x1)

#define PWM_REG104_RESERVED_16_31_POS (16)
#define PWM_REG104_RESERVED_16_31_MASK (0xffff)

#define PWM_REG105_ADDR (SOC_PWM_REG_BASE + (0x105 << 2))

#define PWM_REG105_RESERVED_0_8_POS (0)
#define PWM_REG105_RESERVED_0_8_MASK (0x1ff)

#define PWM_REG105_UG1_POS (9)
#define PWM_REG105_UG1_MASK (0x1)

#define PWM_REG105_UG2_POS (10)
#define PWM_REG105_UG2_MASK (0x1)

#define PWM_REG105_UG3_POS (11)
#define PWM_REG105_UG3_MASK (0x1)

#define PWM_REG105_TG1_POS (12)
#define PWM_REG105_TG1_MASK (0x1)

#define PWM_REG105_TG2_POS (13)
#define PWM_REG105_TG2_MASK (0x1)

#define PWM_REG105_TG3_POS (14)
#define PWM_REG105_TG3_MASK (0x1)

#define PWM_REG105_COMG_POS (15)
#define PWM_REG105_COMG_MASK (0x1)

#define PWM_REG105_DTM1_POS (16)
#define PWM_REG105_DTM1_MASK (0x3)

#define PWM_REG105_DTM2_POS (18)
#define PWM_REG105_DTM2_MASK (0x3)

#define PWM_REG105_DTM3_POS (20)
#define PWM_REG105_DTM3_MASK (0x3)

#define PWM_REG105_RESERVED_22_31_POS (22)
#define PWM_REG105_RESERVED_22_31_MASK (0x3ff)

#define PWM_REG106_ADDR (SOC_PWM_REG_BASE + (0x106 << 2))

#define PWM_REG106_CH1P_POS (0)
#define PWM_REG106_CH1P_MASK (0x3)

#define PWM_REG106_CH2P_POS (2)
#define PWM_REG106_CH2P_MASK (0x3)

#define PWM_REG106_CH3P_POS (4)
#define PWM_REG106_CH3P_MASK (0x3)

#define PWM_REG106_CH4P_POS (6)
#define PWM_REG106_CH4P_MASK (0x3)

#define PWM_REG106_CH5P_POS (8)
#define PWM_REG106_CH5P_MASK (0x3)

#define PWM_REG106_CH6P_POS (10)
#define PWM_REG106_CH6P_MASK (0x3)

#define PWM_REG106_CH1E_POS (12)
#define PWM_REG106_CH1E_MASK (0x1)

#define PWM_REG106_CH2E_POS (13)
#define PWM_REG106_CH2E_MASK (0x1)

#define PWM_REG106_CH3E_POS (14)
#define PWM_REG106_CH3E_MASK (0x1)

#define PWM_REG106_CH4E_POS (15)
#define PWM_REG106_CH4E_MASK (0x1)

#define PWM_REG106_CH5E_POS (16)
#define PWM_REG106_CH5E_MASK (0x1)

#define PWM_REG106_CH6E_POS (17)
#define PWM_REG106_CH6E_MASK (0x1)

#define PWM_REG106_TIM1CCM_POS (18)
#define PWM_REG106_TIM1CCM_MASK (0x1)

#define PWM_REG106_TIM2CCM_POS (19)
#define PWM_REG106_TIM2CCM_MASK (0x1)

#define PWM_REG106_TIM3CCM_POS (20)
#define PWM_REG106_TIM3CCM_MASK (0x1)

#define PWM_REG106_OC1M_POS (21)
#define PWM_REG106_OC1M_MASK (0x7)

#define PWM_REG106_OC2M_POS (24)
#define PWM_REG106_OC2M_MASK (0x7)

#define PWM_REG106_OC3M_POS (27)
#define PWM_REG106_OC3M_MASK (0x7)

#define PWM_REG106_RESERVED_30_31_POS (30)
#define PWM_REG106_RESERVED_30_31_MASK (0x3)

#define PWM_REG107_ADDR (SOC_PWM_REG_BASE + (0x107 << 2))

#define PWM_REG107_TIM1_CNT_POS (0)
#define PWM_REG107_TIM1_CNT_MASK (0xffffffff)

#define PWM_REG108_ADDR (SOC_PWM_REG_BASE + (0x108 << 2))

#define PWM_REG108_TIM2_CNT_POS (0)
#define PWM_REG108_TIM2_CNT_MASK (0xffffffff)

#define PWM_REG109_ADDR (SOC_PWM_REG_BASE + (0x109 << 2))

#define PWM_REG109_TIM3_CNT_POS (0)
#define PWM_REG109_TIM3_CNT_MASK (0xffffffff)

#define PWM_REG10A_ADDR (SOC_PWM_REG_BASE + (0x10a << 2))

#define PWM_REG10A_PSC1_POS (0)
#define PWM_REG10A_PSC1_MASK (0xff)

#define PWM_REG10A_PSC2_POS (8)
#define PWM_REG10A_PSC2_MASK (0xff)

#define PWM_REG10A_PSC3_POS (16)
#define PWM_REG10A_PSC3_MASK (0xff)

#define PWM_REG10A_RESERVED_24_31_POS (24)
#define PWM_REG10A_RESERVED_24_31_MASK (0xff)

#define PWM_REG10B_ADDR (SOC_PWM_REG_BASE + (0x10b << 2))

#define PWM_REG10B_TIM1_ARR_POS (0)
#define PWM_REG10B_TIM1_ARR_MASK (0xffffffff)

#define PWM_REG10C_ADDR (SOC_PWM_REG_BASE + (0x10c << 2))

#define PWM_REG10C_TIM2_ARR_POS (0)
#define PWM_REG10C_TIM2_ARR_MASK (0xffffffff)

