Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/pwm_reg.h
#define PWM_REG10D_ADDR (SOC_PWM_REG_BASE + (0x10d << 2))

#define PWM_REG10D_TIM3_ARR_POS (0)
#define PWM_REG10D_TIM3_ARR_MASK (0xffffffff)

#define PWM_REG10E_ADDR (SOC_PWM_REG_BASE + (0x10e << 2))

#define PWM_REG10E_TIM1_RCR_POS (0)
#define PWM_REG10E_TIM1_RCR_MASK (0xffffffff)

#define PWM_REG10F_ADDR (SOC_PWM_REG_BASE + (0x10f << 2))

#define PWM_REG10F_TIM2_RCR_POS (0)
#define PWM_REG10F_TIM2_RCR_MASK (0xffffffff)

#define PWM_REG110_ADDR (SOC_PWM_REG_BASE + (0x110 << 2))

#define PWM_REG110_TIM3_RCR_POS (0)
#define PWM_REG110_TIM3_RCR_MASK (0xffffffff)

#define PWM_REG111_ADDR (SOC_PWM_REG_BASE + (0x111 << 2))

#define PWM_REG111_CCR1_POS (0)
#define PWM_REG111_CCR1_MASK (0xffffffff)

#define PWM_REG112_ADDR (SOC_PWM_REG_BASE + (0x112 << 2))

#define PWM_REG112_CCR2_POS (0)
#define PWM_REG112_CCR2_MASK (0xffffffff)

#define PWM_REG113_ADDR (SOC_PWM_REG_BASE + (0x113 << 2))

#define PWM_REG113_CCR3_POS (0)
#define PWM_REG113_CCR3_MASK (0xffffffff)

#define PWM_REG114_ADDR (SOC_PWM_REG_BASE + (0x114 << 2))

#define PWM_REG114_CCR4_POS (0)
#define PWM_REG114_CCR4_MASK (0xffffffff)

#define PWM_REG115_ADDR (SOC_PWM_REG_BASE + (0x115 << 2))

#define PWM_REG115_CCR5_POS (0)
#define PWM_REG115_CCR5_MASK (0xffffffff)

#define PWM_REG116_ADDR (SOC_PWM_REG_BASE + (0x116 << 2))

#define PWM_REG116_CCR6_POS (0)
#define PWM_REG116_CCR6_MASK (0xffffffff)

#define PWM_REG117_ADDR (SOC_PWM_REG_BASE + (0x117 << 2))

#define PWM_REG117_CCR7_POS (0)
#define PWM_REG117_CCR7_MASK (0xffffffff)

#define PWM_REG118_ADDR (SOC_PWM_REG_BASE + (0x118 << 2))

#define PWM_REG118_CCR8_POS (0)
#define PWM_REG118_CCR8_MASK (0xffffffff)

#define PWM_REG119_ADDR (SOC_PWM_REG_BASE + (0x119 << 2))

#define PWM_REG119_CCR9_POS (0)
#define PWM_REG119_CCR9_MASK (0xffffffff)

#define PWM_REG11A_ADDR (SOC_PWM_REG_BASE + (0x11a << 2))

#define PWM_REG11A_DT1_POS (0)
#define PWM_REG11A_DT1_MASK (0x3ff)

#define PWM_REG11A_DT2_POS (10)
#define PWM_REG11A_DT2_MASK (0x3ff)

#define PWM_REG11A_DT3_POS (20)
#define PWM_REG11A_DT3_MASK (0x3ff)

#define PWM_REG11A_RESERVED_30_31_POS (30)
#define PWM_REG11A_RESERVED_30_31_MASK (0x3)

#define PWM_REG11B_ADDR (SOC_PWM_REG_BASE + (0x11b << 2))

#define PWM_REG11B_TIM1_ARR_SHAD_POS (0)
#define PWM_REG11B_TIM1_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG11C_ADDR (SOC_PWM_REG_BASE + (0x11c << 2))

#define PWM_REG11C_TIM2_ARR_SHAD_POS (0)
#define PWM_REG11C_TIM2_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG11D_ADDR (SOC_PWM_REG_BASE + (0x11d << 2))

#define PWM_REG11D_TIM3_ARR_SHAD_POS (0)
#define PWM_REG11D_TIM3_ARR_SHAD_MASK (0xffffffff)

#define PWM_REG11E_ADDR (SOC_PWM_REG_BASE + (0x11e << 2))

#define PWM_REG11E_TIM1_RCR_SHAD_POS (0)
#define PWM_REG11E_TIM1_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG11F_ADDR (SOC_PWM_REG_BASE + (0x11f << 2))

#define PWM_REG11F_TIM2_RCR_SHAD_POS (0)
#define PWM_REG11F_TIM2_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG120_ADDR (SOC_PWM_REG_BASE + (0x120 << 2))

#define PWM_REG120_TIM3_RCR_SHAD_POS (0)
#define PWM_REG120_TIM3_RCR_SHAD_MASK (0xffffffff)

#define PWM_REG121_ADDR (SOC_PWM_REG_BASE + (0x121 << 2))

#define PWM_REG121_CCR1_SHAD_POS (0)
#define PWM_REG121_CCR1_SHAD_MASK (0xffffffff)

#define PWM_REG122_ADDR (SOC_PWM_REG_BASE + (0x122 << 2))

#define PWM_REG122_CCR2_SHAD_POS (0)
#define PWM_REG122_CCR2_SHAD_MASK (0xffffffff)

#define PWM_REG123_ADDR (SOC_PWM_REG_BASE + (0x123 << 2))

#define PWM_REG123_CCR3_SHAD_POS (0)
#define PWM_REG123_CCR3_SHAD_MASK (0xffffffff)

#define PWM_REG124_ADDR (SOC_PWM_REG_BASE + (0x124 << 2))

#define PWM_REG124_CCR4_SHAD_POS (0)
#define PWM_REG124_CCR4_SHAD_MASK (0xffffffff)

#define PWM_REG125_ADDR (SOC_PWM_REG_BASE + (0x125 << 2))

#define PWM_REG125_CCR5_SHAD_POS (0)
#define PWM_REG125_CCR5_SHAD_MASK (0xffffffff)

#define PWM_REG126_ADDR (SOC_PWM_REG_BASE + (0x126 << 2))

#define PWM_REG126_CCR6_SHAD_POS (0)
#define PWM_REG126_CCR6_SHAD_MASK (0xffffffff)

#define PWM_REG127_ADDR (SOC_PWM_REG_BASE + (0x127 << 2))

#define PWM_REG127_CCR7_SHAD_POS (0)
#define PWM_REG127_CCR7_SHAD_MASK (0xffffffff)

#define PWM_REG128_ADDR (SOC_PWM_REG_BASE + (0x128 << 2))

#define PWM_REG128_CCR8_SHAD_POS (0)
#define PWM_REG128_CCR8_SHAD_MASK (0xffffffff)

#define PWM_REG129_ADDR (SOC_PWM_REG_BASE + (0x129 << 2))

#define PWM_REG129_CCR9_SHAD_POS (0)
#define PWM_REG129_CCR9_SHAD_MASK (0xffffffff)

#define PWM_REG12A_ADDR (SOC_PWM_REG_BASE + (0x12a << 2))

#define PWM_REG12A_CH6E_SHAD_POS (0)
#define PWM_REG12A_CH6E_SHAD_MASK (0x1)

#define PWM_REG12A_CH5E_SHAD_POS (1)
#define PWM_REG12A_CH5E_SHAD_MASK (0x1)

#define PWM_REG12A_CH4E_SHAD_POS (2)
#define PWM_REG12A_CH4E_SHAD_MASK (0x1)

#define PWM_REG12A_CH3E_SHAD_POS (3)
#define PWM_REG12A_CH3E_SHAD_MASK (0x1)

#define PWM_REG12A_CH2E_SHAD_POS (4)
#define PWM_REG12A_CH2E_SHAD_MASK (0x1)

#define PWM_REG12A_CH1E_SHAD_POS (5)
#define PWM_REG12A_CH1E_SHAD_MASK (0x1)

#define PWM_REG12A_OC1M_SHAD_POS (6)
#define PWM_REG12A_OC1M_SHAD_MASK (0x7)

#define PWM_REG12A_OC2M_SHAD_POS (9)
#define PWM_REG12A_OC2M_SHAD_MASK (0x7)

#define PWM_REG12A_OC3M_SHAD_POS (12)
#define PWM_REG12A_OC3M_SHAD_MASK (0x7)

#define PWM_REG12A_RESERVED_15_31_POS (15)
#define PWM_REG12A_RESERVED_15_31_MASK (0x1ffff)

#ifdef __cplusplus
}
#endif
